// Напишите программу, которая выводит через console.log все числа от 1 до 100, с несколькими исключениями. Для чисел,
// нацело делящихся на 3, она должна выводить ‘Fizz’, а для чисел, делящихся на 5 – ‘Buzz’. Для чисел, которые делятся
// и на 3, и на 5, она должна выводить «FizzBuzz».

function fizzBuzz() {
    for (let i = 1; i < 101; i++) {
        let res = '';
        if (i % 3 == 0) {
            res += 'Fizz';
        }
        if (i % 15 == 0) {
            res += 'Buzz';
        }
        console.log(res || i);
    }
}